------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/appertjt/Documents/GradSchool/econometricsFall19/homework2/repo/econometrics743HW2/inv.log
  log type:  text
 opened on:  17 Nov 2019, 16:09:22

. 
. *Ordinary least squares
. *Start with creating a lagged variable for investment rate
. *Need to sort by firm and by year
. sort firm year

. by firm: gen invrate_lag = invrate[_n-1]
(703 missing values generated)

. 
. reg invrate invrate_lag i.year, robust

Linear regression                               Number of obs     =      4,966
                                                F(13, 4952)       =      20.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0828
                                                Root MSE          =     .12325

------------------------------------------------------------------------------
             |               Robust
     invrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 invrate_lag |   .2668748    .019044    14.01   0.000     .2295402    .3042094
             |
        year |
       1989  |   .0117017   .0185858     0.63   0.529    -.0247347    .0481381
       1990  |  -.0207518   .0188639    -1.10   0.271    -.0577334    .0162299
       1991  |  -.0389914   .0178562    -2.18   0.029    -.0739974   -.0039854
       1992  |  -.0266434   .0176001    -1.51   0.130    -.0611473    .0078606
       1993  |  -.0298507   .0175135    -1.70   0.088    -.0641848    .0044835
       1994  |  -.0230369   .0175715    -1.31   0.190    -.0574849    .0114111
       1995  |  -.0157777   .0175294    -0.90   0.368    -.0501431    .0185878
       1996  |  -.0229774   .0174225    -1.32   0.187    -.0571332    .0111785
       1997  |  -.0230178   .0178666    -1.29   0.198    -.0580443    .0120087
       1998  |  -.0164674   .0181027    -0.91   0.363    -.0519567    .0190218
       1999  |  -.0238043   .0192515    -1.24   0.216    -.0615459    .0139373
       2000  |   -.043302   .0197696    -2.19   0.029    -.0820591   -.0045449
             |
       _cons |   .1218266   .0172059     7.08   0.000     .0880953    .1555578
------------------------------------------------------------------------------

. 
. *Now do the same regression using the instructions from Fossen's do file
. 
. tsset firm year, yearly
       panel variable:  firm (unbalanced)
        time variable:  year, 1987 to 2000
                delta:  1 year

. 
. xi: regress invrate l.invrate i.year, robust cluster(firm)
i.year            _Iyear_1987-2000    (naturally coded; _Iyear_1987 omitted)
note: _Iyear_1988 omitted because of collinearity

Linear regression                               Number of obs     =      4,966
                                                F(13, 702)        =      20.31
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0828
                                                Root MSE          =     .12325

                                 (Std. Err. adjusted for 703 clusters in firm)
------------------------------------------------------------------------------
             |               Robust
     invrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     invrate |
         L1. |   .2668748   .0185799    14.36   0.000     .2303959    .3033536
             |
 _Iyear_1988 |          0  (omitted)
 _Iyear_1989 |   .0117017   .0186407     0.63   0.530    -.0248964    .0482998
 _Iyear_1990 |  -.0207518   .0174746    -1.19   0.235    -.0550604    .0135569
 _Iyear_1991 |  -.0389914   .0180302    -2.16   0.031    -.0743909   -.0035918
 _Iyear_1992 |  -.0266434   .0175064    -1.52   0.128    -.0610145    .0077277
 _Iyear_1993 |  -.0298507   .0174987    -1.71   0.088    -.0642066    .0045053
 _Iyear_1994 |  -.0230369   .0176079    -1.31   0.191    -.0576074    .0115337
 _Iyear_1995 |  -.0157777     .01733    -0.91   0.363    -.0498025    .0182471
 _Iyear_1996 |  -.0229774   .0173951    -1.32   0.187      -.05713    .0111753
 _Iyear_1997 |  -.0230178   .0178574    -1.29   0.198    -.0580781    .0120424
 _Iyear_1998 |  -.0164674   .0179287    -0.92   0.359    -.0516678    .0187329
 _Iyear_1999 |  -.0238043   .0193776    -1.23   0.220    -.0618492    .0142406
 _Iyear_2000 |   -.043302   .0199293    -2.17   0.030    -.0824302   -.0041738
       _cons |   .1218266   .0172542     7.06   0.000     .0879506    .1557025
------------------------------------------------------------------------------

. 
. *Both methods return the same results for coefficients but slightly different standard errors
. 
. 
. *Do the within groups regression
. *Note: this is currently returning a higher value than paper
. *FF says to expect this difference in assignment.
. 
. xtreg invrate invrate_lag i.year, fe

Fixed-effects (within) regression               Number of obs     =      4,966
Group variable: firm                            Number of groups  =        703

R-sq:                                           Obs per group:
     within  = 0.0342                                         min =          3
     between = 0.0244                                         avg =        7.1
     overall = 0.0090                                         max =         13

                                                F(13,4250)        =      11.57
corr(u_i, Xb)  = -0.1512                        Prob > F          =     0.0000

------------------------------------------------------------------------------
     invrate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 invrate_lag |  -.0069687   .0155685    -0.45   0.654     -.037491    .0235537
             |
        year |
       1989  |  -.0007833   .0143968    -0.05   0.957    -.0290085    .0274419
       1990  |  -.0379181   .0142357    -2.66   0.008    -.0658275   -.0100087
       1991  |  -.0697115   .0142365    -4.90   0.000    -.0976225   -.0418004
       1992  |  -.0684519   .0142355    -4.81   0.000    -.0963609   -.0405429
       1993  |  -.0731719   .0141814    -5.16   0.000    -.1009749   -.0453689
       1994  |  -.0688035   .0141221    -4.87   0.000    -.0964901   -.0411168
       1995  |  -.0645893   .0141369    -4.57   0.000     -.092305   -.0368735
       1996  |  -.0731357   .0141608    -5.16   0.000    -.1008984   -.0453731
       1997  |   -.079783   .0142694    -5.59   0.000    -.1077584   -.0518076
       1998  |  -.0750013   .0144441    -5.19   0.000    -.1033193   -.0466832
       1999  |  -.0842675   .0147578    -5.71   0.000    -.1132004   -.0553346
       2000  |   -.110215   .0158722    -6.94   0.000    -.1413327   -.0790972
             |
       _cons |    .207273   .0134439    15.42   0.000      .180916      .23363
-------------+----------------------------------------------------------------
     sigma_u |  .08380544
     sigma_e |  .11564545
         rho |  .34432884   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(702, 4250) = 1.96                   Prob > F = 0.0000

. 
. *2SLS estimate using the second lagged variable and first differences
. 
. sort firm year

. by firm: gen invrate_lag2 = invrate_lag[_n-1]
(1,406 missing values generated)

. by firm: gen invrate_lag3=invrate_lag2[_n-1]
(2,109 missing values generated)

. 
. ivregress 2sls d.invrate i.year (d.invrate_lag=invrate_lag2), robust cluster(firm)
note: 1987.year identifies no observations in the sample
note: 1988.year identifies no observations in the sample
note: 2000.year omitted because of collinearity

Instrumental variables (2SLS) regression          Number of obs   =      4,263
                                                  Wald chi2(12)   =      82.10
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =          .
                                                  Root MSE        =     .16546

                                 (Std. Err. adjusted for 703 clusters in firm)
------------------------------------------------------------------------------
             |               Robust
   D.invrate |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 invrate_lag |
         D1. |   .1625582    .036222     4.49   0.000     .0915644    .2335521
             |
        year |
       1987  |          0  (empty)
       1988  |          0  (empty)
       1989  |   .0175129   .0278973     0.63   0.530    -.0371647    .0721905
       1990  |  -.0128438   .0208861    -0.61   0.539    -.0537798    .0280923
       1991  |  -.0064921   .0196981    -0.33   0.742    -.0450997    .0321155
       1992  |   .0301324   .0185233     1.63   0.104    -.0061727    .0664374
       1993  |   .0209974     .01846     1.14   0.255    -.0151835    .0571783
       1994  |   .0243187   .0184001     1.32   0.186    -.0117448    .0603821
       1995  |   .0265223   .0182083     1.46   0.145    -.0091654      .06221
       1996  |   .0114813   .0185391     0.62   0.536    -.0248546    .0478172
       1997  |   .0155013   .0178183     0.87   0.384     -.019422    .0504245
       1998  |   .0291769   .0189019     1.54   0.123    -.0078702     .066224
       1999  |   .0074461   .0252147     0.30   0.768    -.0419739    .0568661
       2000  |          0  (omitted)
             |
       _cons |  -.0237391   .0170797    -1.39   0.165    -.0572146    .0097364
------------------------------------------------------------------------------
Instrumented:  D.invrate_lag
Instruments:   1989.year 1990.year 1991.year 1992.year 1993.year 1994.year
               1995.year 1996.year 1997.year 1998.year 1999.year
               invrate_lag2

. 
. *gmm estimator
. 
. xi: xtabond invrate i.year , maxldep(2) robust
i.year            _Iyear_1987-2000    (naturally coded; _Iyear_1987 omitted)
note: _Iyear_1988 dropped because of collinearity

Arellano-Bond dynamic panel-data estimation     Number of obs     =      4,263
Group variable: firm                            Number of groups  =        703
Time variable: year
                                                Obs per group:
                                                              min =          2
                                                              avg =   6.064011
                                                              max =         12

Number of instruments =     36                  Wald chi2(13)     =     157.96
                                                Prob > chi2       =     0.0000
One-step results
                                   (Std. Err. adjusted for clustering on firm)
------------------------------------------------------------------------------
             |               Robust
     invrate |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     invrate |
         L1. |   .1592601   .0327361     4.86   0.000     .0950985    .2234218
             |
 _Iyear_1989 |  -.0107714    .017616    -0.61   0.541    -.0452982    .0237554
 _Iyear_1990 |  -.0484577   .0179135    -2.71   0.007    -.0835674    -.013348
 _Iyear_1991 |  -.0769807   .0175391    -4.39   0.000    -.1113568   -.0426046
 _Iyear_1992 |  -.0723108   .0172751    -4.19   0.000    -.1061695   -.0384522
 _Iyear_1993 |  -.0759606   .0173499    -4.38   0.000    -.1099657   -.0419555
 _Iyear_1994 |  -.0762196   .0174456    -4.37   0.000    -.1104123   -.0420268
 _Iyear_1995 |  -.0733835   .0173738    -4.22   0.000    -.1074355   -.0393315
 _Iyear_1996 |  -.0861784   .0173765    -4.96   0.000    -.1202358    -.052121
 _Iyear_1997 |  -.0936953   .0180486    -5.19   0.000    -.1290699   -.0583208
 _Iyear_1998 |  -.0876543   .0184572    -4.75   0.000    -.1238298   -.0514788
 _Iyear_1999 |  -.1042047   .0198282    -5.26   0.000    -.1430672   -.0653423
 _Iyear_2000 |  -.1286904   .0223441    -5.76   0.000    -.1724841   -.0848967
       _cons |   .1921735   .0173057    11.10   0.000     .1582549     .226092
------------------------------------------------------------------------------
Instruments for differenced equation
        GMM-type: L(2/3).invrate
        Standard: D._Iyear_1988 D._Iyear_1989 D._Iyear_1990 D._Iyear_1991
                  D._Iyear_1992 D._Iyear_1993 D._Iyear_1994 D._Iyear_1995
                  D._Iyear_1996 D._Iyear_1997 D._Iyear_1998 D._Iyear_1999
                  D._Iyear_2000
Instruments for level equation
        Standard: _cons

. 
. *test for serial correlation
. estat abond

Arellano-Bond test for zero autocorrelation in first-differenced errors
  +-----------------------+
  |Order |  z     Prob > z|
  |------+----------------|
  |   1  |-10.914  0.0000 |
  |   2  | .52212  0.6016 |
  +-----------------------+
   H0: no autocorrelation 

. 
. 
. *Now run it again without restrictions on the levels
. 
. xi: xtabond invrate i.year , robust
i.year            _Iyear_1987-2000    (naturally coded; _Iyear_1987 omitted)
note: _Iyear_1988 dropped because of collinearity

Arellano-Bond dynamic panel-data estimation     Number of obs     =      4,263
Group variable: firm                            Number of groups  =        703
Time variable: year
                                                Obs per group:
                                                              min =          2
                                                              avg =   6.064011
                                                              max =         12

Number of instruments =     91                  Wald chi2(13)     =     160.93
                                                Prob > chi2       =     0.0000
One-step results
                                   (Std. Err. adjusted for clustering on firm)
------------------------------------------------------------------------------
             |               Robust
     invrate |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     invrate |
         L1. |   .1559496   .0317628     4.91   0.000     .0936957    .2182035
             |
 _Iyear_1989 |   -.001453   .0164401    -0.09   0.930     -.033675     .030769
 _Iyear_1990 |  -.0391626   .0171618    -2.28   0.022     -.072799   -.0055261
 _Iyear_1991 |  -.0674034   .0165314    -4.08   0.000    -.0998043   -.0350024
 _Iyear_1992 |  -.0622011   .0164367    -3.78   0.000    -.0944165   -.0299856
 _Iyear_1993 |  -.0653611   .0164824    -3.97   0.000     -.097666   -.0330563
 _Iyear_1994 |  -.0663283   .0164782    -4.03   0.000    -.0986251   -.0340316
 _Iyear_1995 |  -.0630385   .0163531    -3.85   0.000      -.09509    -.030987
 _Iyear_1996 |  -.0754774   .0163788    -4.61   0.000    -.1075793   -.0433754
 _Iyear_1997 |  -.0832997   .0170433    -4.89   0.000    -.1167039   -.0498954
 _Iyear_1998 |  -.0775998   .0174256    -4.45   0.000    -.1117534   -.0434462
 _Iyear_1999 |  -.0944478   .0188996    -5.00   0.000    -.1314903   -.0574054
 _Iyear_2000 |   -.119053   .0214867    -5.54   0.000    -.1611661   -.0769399
       _cons |   .1828078   .0166438    10.98   0.000     .1501866    .2154289
------------------------------------------------------------------------------
Instruments for differenced equation
        GMM-type: L(2/.).invrate
        Standard: D._Iyear_1988 D._Iyear_1989 D._Iyear_1990 D._Iyear_1991
                  D._Iyear_1992 D._Iyear_1993 D._Iyear_1994 D._Iyear_1995
                  D._Iyear_1996 D._Iyear_1997 D._Iyear_1998 D._Iyear_1999
                  D._Iyear_2000
Instruments for level equation
        Standard: _cons

. 
. *test for serial correlation
. estat abond

Arellano-Bond test for zero autocorrelation in first-differenced errors
  +-----------------------+
  |Order |  z     Prob > z|
  |------+----------------|
  |   1  |-11.121  0.0000 |
  |   2  | .46236  0.6438 |
  +-----------------------+
   H0: no autocorrelation 

. 
. clear

. use usbal89

. tsset id year , yearly
       panel variable:  id (strongly balanced)
        time variable:  year, 1982 to 1989
                delta:  1 year

. *Column 1*
. regress y n n_1 k k_1 y_1 i.year , robust cluster(id)

Linear regression                               Number of obs     =      3,563
                                                F(11, 508)        =   75113.93
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9949
                                                Root MSE          =      .1426

                                   (Std. Err. adjusted for 509 clusters in id)
------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           n |   .4789653   .0288963    16.58   0.000     .4221944    .5357362
         n_1 |  -.4233997   .0305806   -13.85   0.000    -.4834797   -.3633198
           k |   .2348098   .0352859     6.65   0.000     .1654854    .3041341
         k_1 |  -.2120621   .0347141    -6.11   0.000     -.280263   -.1438613
         y_1 |   .9216418   .0105283    87.54   0.000     .9009575    .9423261
             |
        year |
       1984  |   .0661134   .0096619     6.84   0.000     .0471313    .0850956
       1985  |   .0127151   .0101712     1.25   0.212    -.0072678     .032698
       1986  |    .034839   .0102827     3.39   0.001     .0146373    .0550408
       1987  |   .0767564   .0086928     8.83   0.000     .0596782    .0938346
       1988  |   .0779253   .0094209     8.27   0.000     .0594167     .096434
       1989  |   .0356445   .0097659     3.65   0.000     .0164579    .0548311
             |
       _cons |    .246604   .0322971     7.64   0.000     .1831516    .3100564
------------------------------------------------------------------------------

. *Column 2*
. xtreg y n n_1 k k_1 y_1 i.year , fe robust cluster(id)

Fixed-effects (within) regression               Number of obs     =      3,563
Group variable: id                              Number of groups  =        509

R-sq:                                           Obs per group:
     within  = 0.7825                                         min =          7
     between = 0.9879                                         avg =        7.0
     overall = 0.9847                                         max =          7

                                                F(11,508)         =     345.86
corr(u_i, Xb)  = 0.7191                         Prob > F          =     0.0000

                                   (Std. Err. adjusted for 509 clusters in id)
------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           n |   .4880013   .0299207    16.31   0.000     .4292178    .5467848
         n_1 |  -.0231194     .03455    -0.67   0.504    -.0909977     .044759
           k |   .1765454   .0340853     5.18   0.000     .1095799    .2435109
         k_1 |  -.1305487   .0252882    -5.16   0.000    -.1802311   -.0808663
         y_1 |   .4039344   .0293221    13.78   0.000     .3463269    .4615418
             |
        year |
       1984  |   .0564054   .0074048     7.62   0.000     .0418576    .0709533
       1985  |   .0271379   .0092935     2.92   0.004     .0088795    .0453963
       1986  |   .0494812   .0116301     4.25   0.000     .0266322    .0723302
       1987  |   .1033078   .0116548     8.86   0.000     .0804104    .1262053
       1988  |   .1310847     .01305    10.04   0.000     .1054461    .1567234
       1989  |   .1174383   .0150838     7.79   0.000      .087804    .1470726
             |
       _cons |   2.625541   .1591593    16.50   0.000      2.31285    2.938233
-------------+----------------------------------------------------------------
     sigma_u |  .31731619
     sigma_e |  .12076713
         rho |  .87347826   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. ssc install xtabond2
checking xtabond2 consistency and verifying not already installed...
all files already exist and are up to date.

. *Column 3*
. xtabond2 y n n_1 k k_1 y_1 i.year, gmm(y n k, lag(2 .)) iv(i.year) robust noleveleq
Favoring space over speed. To switch, type or click on mata: mata set matafavor speed, perm.
Warning: Two-step estimated covariance matrix of moments is singular.
  Using a generalized inverse to calculate robust weighting matrix for Hansen test.
  Difference-in-Sargan/Hansen statistics may be negative.

Dynamic panel-data estimation, one-step difference GMM
------------------------------------------------------------------------------
Group variable: id                              Number of obs      =      3054
Time variable : year                            Number of groups   =       509
Number of instruments = 69                      Obs per group: min =         6
Wald chi2(13) =   1340.23                                      avg =      6.00
Prob > chi2   =     0.000                                      max =         6
------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           n |   .5128697   .0892432     5.75   0.000     .3379563    .6877831
         n_1 |   .0726061   .0927269     0.78   0.434    -.1091353    .2543474
           k |   .1318291   .1179029     1.12   0.264    -.0992563    .3629144
         k_1 |  -.2066298   .0949589    -2.18   0.030    -.3927458   -.0205137
         y_1 |   .3264209   .0521606     6.26   0.000     .2241881    .4286538
             |
        year |
       1982  |          0  (empty)
       1983  |  -.0565042   .0139574    -4.05   0.000    -.0838602   -.0291482
       1984  |   .0111054   .0092835     1.20   0.232    -.0070898    .0293007
       1985  |          0  (omitted)
       1986  |   .0347948   .0098768     3.52   0.000     .0154366    .0541531
       1987  |   .0987342   .0126165     7.83   0.000     .0740063    .1234621
       1988  |   .1363566   .0146547     9.30   0.000      .107634    .1650792
       1989  |   .1334924    .017638     7.57   0.000     .0989225    .1680623
------------------------------------------------------------------------------
Instruments for first differences equation
  Standard
    D.(1982b.year 1983.year 1984.year 1985.year 1986.year 1987.year 1988.year
    1989.year)
  GMM-type (missing=0, separate instruments for each period unless collapsed)
    L(2/7).(y n k)
------------------------------------------------------------------------------
Arellano-Bond test for AR(1) in first differences: z =  -6.21  Pr > z =  0.000
Arellano-Bond test for AR(2) in first differences: z =  -1.36  Pr > z =  0.173
------------------------------------------------------------------------------
Sargan test of overid. restrictions: chi2(56)   = 213.56  Prob > chi2 =  0.000
  (Not robust, but not weakened by many instruments.)
Hansen test of overid. restrictions: chi2(56)   =  98.39  Prob > chi2 =  0.000
  (Robust, but weakened by many instruments.)

Difference-in-Hansen tests of exogeneity of instrument subsets:
  iv(1982b.year 1983.year 1984.year 1985.year 1986.year 1987.year 1988.year 1989.year)
    Hansen test excluding group:     chi2(50)   =  78.58  Prob > chi2 =  0.006
    Difference (null H = exogenous): chi2(6)    =  19.81  Prob > chi2 =  0.003


. *Column 4*
. xtabond2 y n n_1 k k_1 y_1 i.year, gmm(y n k, lag(3 .)) iv(i.year) robust noleveleq
Favoring space over speed. To switch, type or click on mata: mata set matafavor speed, perm.
Warning: Two-step estimated covariance matrix of moments is singular.
  Using a generalized inverse to calculate robust weighting matrix for Hansen test.
  Difference-in-Sargan/Hansen statistics may be negative.

Dynamic panel-data estimation, one-step difference GMM
------------------------------------------------------------------------------
Group variable: id                              Number of obs      =      3054
Time variable : year                            Number of groups   =       509
Number of instruments = 51                      Obs per group: min =         6
Wald chi2(13) =   1665.43                                      avg =      6.00
Prob > chi2   =     0.000                                      max =         6
------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           n |   .4987448    .101461     4.92   0.000     .2998848    .6976047
         n_1 |  -.1469956    .113259    -1.30   0.194    -.3689792     .074988
           k |   .1940721    .153916     1.26   0.207    -.1075977    .4957419
         k_1 |  -.1054642    .109791    -0.96   0.337    -.3206507    .1097223
         y_1 |   .4261318   .0791759     5.38   0.000       .27095    .5813137
             |
        year |
       1982  |          0  (empty)
       1983  |  -.0250824   .0189921    -1.32   0.187    -.0623063    .0121415
       1984  |   .0301923   .0111131     2.72   0.007      .008411    .0519736
       1985  |          0  (omitted)
       1986  |   .0185117   .0100543     1.84   0.066    -.0011944    .0382178
       1987  |   .0676855   .0144321     4.69   0.000     .0393991    .0959719
       1988  |   .0945232   .0177249     5.33   0.000      .059783    .1292634
       1989  |   .0792494   .0244059     3.25   0.001     .0314147    .1270841
------------------------------------------------------------------------------
Instruments for first differences equation
  Standard
    D.(1982b.year 1983.year 1984.year 1985.year 1986.year 1987.year 1988.year
    1989.year)
  GMM-type (missing=0, separate instruments for each period unless collapsed)
    L(3/7).(y n k)
------------------------------------------------------------------------------
Arellano-Bond test for AR(1) in first differences: z =  -5.09  Pr > z =  0.000
Arellano-Bond test for AR(2) in first differences: z =  -0.79  Pr > z =  0.429
------------------------------------------------------------------------------
Sargan test of overid. restrictions: chi2(38)   =  86.43  Prob > chi2 =  0.000
  (Not robust, but not weakened by many instruments.)
Hansen test of overid. restrictions: chi2(38)   =  53.66  Prob > chi2 =  0.047
  (Robust, but weakened by many instruments.)

Difference-in-Hansen tests of exogeneity of instrument subsets:
  iv(1982b.year 1983.year 1984.year 1985.year 1986.year 1987.year 1988.year 1989.year)
    Hansen test excluding group:     chi2(32)   =  45.74  Prob > chi2 =  0.055
    Difference (null H = exogenous): chi2(6)    =   7.92  Prob > chi2 =  0.244


. *Column 5*
. xtabond2 y n n_1 k k_1 y_1 i.year, gmm(y n k, lag(2 .)) iv(i.year, equation(level)) robust h(1)
Favoring space over speed. To switch, type or click on mata: mata set matafavor speed, perm.
Warning: Two-step estimated covariance matrix of moments is singular.
  Using a generalized inverse to calculate robust weighting matrix for Hansen test.
  Difference-in-Sargan/Hansen statistics may be negative.

Dynamic panel-data estimation, one-step system GMM
------------------------------------------------------------------------------
Group variable: id                              Number of obs      =      3563
Time variable : year                            Number of groups   =       509
Number of instruments = 88                      Obs per group: min =         7
Wald chi2(13) =   4345.77                                      avg =      7.00
Prob > chi2   =     0.000                                      max =         7
------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           n |   .6239711   .1078013     5.79   0.000     .4126843    .8352578
         n_1 |  -.0925121    .109246    -0.85   0.397    -.3066303     .121606
           k |   .3666974    .130163     2.82   0.005     .1115826    .6218122
         k_1 |  -.3304688   .1063253    -3.11   0.002    -.5388625   -.1220752
         y_1 |   .4650298   .0520106     8.94   0.000     .3630909    .5669688
             |
        year |
       1982  |          0  (empty)
       1983  |  -.1039113   .0226092    -4.60   0.000    -.1482245   -.0595981
       1984  |  -.0564042   .0177351    -3.18   0.001    -.0911643   -.0216441
       1985  |  -.0804099   .0139991    -5.74   0.000    -.1078477   -.0529721
       1986  |   -.051231   .0112871    -4.54   0.000    -.0733534   -.0291086
       1987  |   .0005946   .0110937     0.05   0.957    -.0211487     .022338
       1988  |   .0258688   .0096341     2.69   0.007     .0069863    .0447512
       1989  |          0  (omitted)
             |
       _cons |   2.322886    .249252     9.32   0.000     1.834361    2.811411
------------------------------------------------------------------------------
Instruments for first differences equation
  GMM-type (missing=0, separate instruments for each period unless collapsed)
    L(2/7).(y n k)
Instruments for levels equation
  Standard
    1982b.year 1983.year 1984.year 1985.year 1986.year 1987.year 1988.year
    1989.year
    _cons
  GMM-type (missing=0, separate instruments for each period unless collapsed)
    DL.(y n k)
------------------------------------------------------------------------------
Arellano-Bond test for AR(1) in first differences: z =  -8.17  Pr > z =  0.000
Arellano-Bond test for AR(2) in first differences: z =  -0.60  Pr > z =  0.547
------------------------------------------------------------------------------
Sargan test of overid. restrictions: chi2(74)   = 118.62  Prob > chi2 =  0.001
  (Not robust, but not weakened by many instruments.)
Hansen test of overid. restrictions: chi2(74)   = 142.10  Prob > chi2 =  0.000
  (Robust, but weakened by many instruments.)

Difference-in-Hansen tests of exogeneity of instrument subsets:
  GMM instruments for levels
    Hansen test excluding group:     chi2(56)   =  97.03  Prob > chi2 =  0.001
    Difference (null H = exogenous): chi2(18)   =  45.07  Prob > chi2 =  0.000
  iv(1982b.year 1983.year 1984.year 1985.year 1986.year 1987.year 1988.year 1989.year, eq(level))
    Hansen test excluding group:     chi2(68)   = 122.25  Prob > chi2 =  0.000
    Difference (null H = exogenous): chi2(6)    =  19.85  Prob > chi2 =  0.003


. *Column 6*
. xtabond2 y n n_1 k k_1 y_1 i.year, gmm(y n k, lag(3 .)) iv(i.year, equation(level)) robust h(1)
Favoring space over speed. To switch, type or click on mata: mata set matafavor speed, perm.
Warning: Two-step estimated covariance matrix of moments is singular.
  Using a generalized inverse to calculate robust weighting matrix for Hansen test.
  Difference-in-Sargan/Hansen statistics may be negative.

Dynamic panel-data estimation, one-step system GMM
------------------------------------------------------------------------------
Group variable: id                              Number of obs      =      3563
Time variable : year                            Number of groups   =       509
Number of instruments = 67                      Obs per group: min =         7
Wald chi2(13) =   6449.27                                      avg =      7.00
Prob > chi2   =     0.000                                      max =         7
------------------------------------------------------------------------------
             |               Robust
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           n |   .4700393   .1128454     4.17   0.000     .2488664    .6912121
         n_1 |  -.2833138   .1211054    -2.34   0.019     -.520676   -.0459517
           k |   .3998962   .1525718     2.62   0.009      .100861    .6989314
         k_1 |  -.2148848   .1198197    -1.79   0.073    -.4497271    .0199575
         y_1 |   .6119346   .0995041     6.15   0.000     .4169102     .806959
             |
        year |
       1982  |          0  (empty)
       1983  |  -.0230382   .0181719    -1.27   0.205    -.0586544    .0125781
       1984  |     .01967   .0170552     1.15   0.249    -.0137575    .0530975
       1985  |  -.0275645   .0128499    -2.15   0.032    -.0527498   -.0023792
       1986  |  -.0158706   .0118108    -1.34   0.179    -.0390194    .0072781
       1987  |   .0252069   .0114847     2.19   0.028     .0026973    .0477165
       1988  |   .0386584   .0094319     4.10   0.000     .0201722    .0571446
       1989  |          0  (omitted)
             |
       _cons |   1.109807   .3611194     3.07   0.002     .4020261    1.817588
------------------------------------------------------------------------------
Instruments for first differences equation
  GMM-type (missing=0, separate instruments for each period unless collapsed)
    L(3/7).(y n k)
Instruments for levels equation
  Standard
    1982b.year 1983.year 1984.year 1985.year 1986.year 1987.year 1988.year
    1989.year
    _cons
  GMM-type (missing=0, separate instruments for each period unless collapsed)
    DL2.(y n k)
------------------------------------------------------------------------------
Arellano-Bond test for AR(1) in first differences: z =  -6.71  Pr > z =  0.000
Arellano-Bond test for AR(2) in first differences: z =  -0.42  Pr > z =  0.672
------------------------------------------------------------------------------
Sargan test of overid. restrictions: chi2(53)   =  58.86  Prob > chi2 =  0.270
  (Not robust, but not weakened by many instruments.)
Hansen test of overid. restrictions: chi2(53)   =  75.80  Prob > chi2 =  0.022
  (Robust, but weakened by many instruments.)

Difference-in-Hansen tests of exogeneity of instrument subsets:
  GMM instruments for levels
    Hansen test excluding group:     chi2(38)   =  46.28  Prob > chi2 =  0.168
    Difference (null H = exogenous): chi2(15)   =  29.53  Prob > chi2 =  0.014
  iv(1982b.year 1983.year 1984.year 1985.year 1986.year 1987.year 1988.year 1989.year, eq(level))
    Hansen test excluding group:     chi2(47)   =  64.28  Prob > chi2 =  0.048
    Difference (null H = exogenous): chi2(6)    =  11.52  Prob > chi2 =  0.074


. * test using testnl*
. testnl _b[n_1]= -_b[n]*_b[y_1]

  (1)  _b[n_1] = -_b[n]*_b[y_1]

               chi2(1) =        0.01
           Prob > chi2 =        0.9433

. testnl _b[k_1]= -_b[k]*_b[y_1]

  (1)  _b[k_1] = -_b[k]*_b[y_1]

               chi2(1) =        0.29
           Prob > chi2 =        0.5875

. log close
      name:  <unnamed>
       log:  /home/appertjt/Documents/GradSchool/econometricsFall19/homework2/repo/econometrics743HW2/inv.log
  log type:  text
 closed on:  17 Nov 2019, 16:09:30
------------------------------------------------------------------------------------------------------------------------------------
